liren197968/SweepRobot/Stm32F4/RobotProject/Robot/RocRobotDriver/RocTftLcd/RocTftLcd.c
/********************************************************************************
 * This code is used for robot control
*********************************************************************************
 * Author        Data            Version
 * Liren         2019/04/21      1.0
********************************************************************************/
#include <string.h>

#include "stm32f4xx_hal.h"

#include "RocFont.h"
#include "RocPicture.h"

#include "RocLog.h"
#include "RocTftLcd.h"


static uint8_t g_DisplayNum[10]={0, 1, 2, 3, 4, 5, 6, 7, 8, 9};
static uint8_t g_TftLcdBuff[ROC_TFT_LCD_BUFF_SIZE] = {0};
static uint8_t g_TftLcdStrBuff[ROC_TFT_LCD_STR_BUFF_SIZE] = {0};


/**
  * @brief  TxRx Transfer completed callback.
  * @param  hspi: SPI handle.
  * @note   This example shows a simple way to report end of DMA TxRx transfer, and 
  *         you can add your own implementation. 
  * @retval None
  */
void HAL_SPI_TxCpltCallback(SPI_HandleTypeDef *hspi)
{
    if(SPI1 == hspi->Instance)
    {

    }
}

/**
  * @brief  SPI error callbacks.
  * @param  hspi: SPI handle
  * @note   This example shows a simple way to report transfer error, and you can
  *         add your own implementation.
  * @retval None
  */
 void HAL_SPI_ErrorCallback(SPI_HandleTypeDef *hspi)
{
    if(SPI1 == hspi->Instance)
    {
        ROC_LOGI("SPI data send is in error");
    }
}
#if 0

/*********************************************************************************
 *  Description:
 *              Set the TFT LCD SPI speed
 *
 *  Parameter:
 *              SpeedSet: the control speed
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
static void RocTftLcdSpiSpeedSet(ROC_TFT_LCD_SPI_DAT_SPEED_e Speed)
{
    hspi1.Instance->CR1 &= 0XFFC7;

    if(ROC_TFT_LCD_SPI_DAT_HIGH_SPEED == Speed)
    {
        hspi1.Instance->CR1 |= SPI_BAUDRATEPRESCALER_2;
    }
    else if(ROC_TFT_LCD_SPI_DAT_LOW_SPEED == Speed)
    {
        hspi1.Instance->CR1 |= SPI_BAUDRATEPRESCALER_32;
    }

    hspi1.Instance->CR1 |= 1 << 6;
}

/*********************************************************************************
 *  Description:
 *              Set the TFT LCD SPI data transmission format
 *
 *  Parameter:
 *              DatFat: the control data format
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
static void RocTftLcdSpiDataFormatSet(ROC_TFT_LCD_SPI_DAT_FORMAT_e DatFot)
{
    hspi1.Instance->CR1 &= ~SPI_DATASIZE_16BIT;

    if(ROC_TFT_LCD_SPI_DAT_8_BIT == DatFot)
    {
        hspi1.Instance->CR1 |= SPI_DATASIZE_8BIT;
    }
    else if(ROC_TFT_LCD_SPI_DAT_16_BIT == DatFot)
    {
        hspi1.Instance->CR1 |= SPI_DATASIZE_16BIT;
    }
}

/*********************************************************************************
 *  Description:
 *              Write command to LCD register
 *
 *  Parameter:
 *              Cmd: the command written to LCD register
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
static void RocTftLcdRegWriteCmd(uint8_t Reg,uint16_t Data)
{
    RocTftLcdWriteReg(Reg);
    RocTftLcdWrite16Dat(Data);
}
#endif

/*********************************************************************************
 *  Description:
 *              Write a byte data with SPI communication
 *
 *  Parameter:
 *              Dat: the data written to SPI
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
static void  RocTftSpiWriteData(uint8_t *Dat, uint16_t DatLen)
{
    HAL_StatusTypeDef WriteStatus;

    while(HAL_SPI_GetState(ROC_TFT_LCD_SPI_CHANNEL) != HAL_SPI_STATE_READY);

    WriteStatus = HAL_SPI_Transmit(ROC_TFT_LCD_SPI_CHANNEL, Dat, DatLen, ROC_TFT_LCD_WRITE_TIME_OUT);
    if(HAL_OK != WriteStatus)
    {
        ROC_LOGE("SPI write data is in error(%d)", WriteStatus);
    }
}

/*********************************************************************************
 *  Description:
 *              Write a byte data with SPI DMA communication
 *
 *  Parameter:
 *              Dat:    the data written to SPI
 *              DatLen: the data length
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
static void  RocTftSpiDmaWriteData(uint8_t *Dat, uint16_t DatLen)
{
    HAL_StatusTypeDef WriteStatus;

    while(HAL_SPI_GetState(ROC_TFT_LCD_SPI_CHANNEL) != HAL_SPI_STATE_READY);

    WriteStatus = HAL_SPI_Transmit_DMA(ROC_TFT_LCD_SPI_CHANNEL, Dat, DatLen);
    if(HAL_OK != WriteStatus)
    {
        ROC_LOGE("SPI write data is in error(%d)", WriteStatus);
    }
}

/*********************************************************************************
 *  Description:
 *              Select register with SPI communication
 *
 *  Parameter:
 *              Reg: the written LCD register
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
static void RocTftLcdWriteReg(uint8_t Reg)
{
    while(HAL_SPI_GetState(ROC_TFT_LCD_SPI_CHANNEL) != HAL_SPI_STATE_READY);

    ROC_TFT_LCD_RS_CLR();

    RocTftSpiWriteData(&Reg, 1);
}

/*********************************************************************************
 *  Description:
 *              Write 8 bit data to LCD register
 *
 *  Parameter:
 *              Data: the data written to LCD register
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
static void RocTftLcdWriteDat(uint8_t Data)
{
    while(HAL_SPI_GetState(ROC_TFT_LCD_SPI_CHANNEL) != HAL_SPI_STATE_READY);

    ROC_TFT_LCD_RS_SET();

    RocTftSpiWriteData(&Data, 1);
}

/*********************************************************************************
 *  Description:
 *              Write 16 bit data to LCD register
 *
 *  Parameter:
 *              Data: the data written to LCD register
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
static void RocTftLcdWrite16Dat(uint16_t Data)
{
    uint8_t Buff[2] = {0};

