liren197968/SweepRobot/Stm32F4/RobotProject/Robot/RocRobotDriver/RocTftLcd/RocTftLcd.c
    Buff[0] = Data >> 8;
    Buff[1] = Data;

    while(HAL_SPI_GetState(ROC_TFT_LCD_SPI_CHANNEL) != HAL_SPI_STATE_READY);

    ROC_TFT_LCD_RS_SET();

    RocTftSpiWriteData(Buff, 2);
    //RocTftSpiDmaWriteData(Buff, 2);
}

/*********************************************************************************
 *  Description:
 *              Wait TFT LCD write done
 *
 *  Parameter:
 *              None
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
static void RocTftLcdWaitWriteDone(void)
{
    while(HAL_SPI_GetState(ROC_TFT_LCD_SPI_CHANNEL) != HAL_SPI_STATE_READY);
}

/*********************************************************************************
 *  Description:
 *              Reset TFT LCD
 *
 *  Parameter:
 *              None
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
static void RocTftLcdReset(void)
{
    ROC_TFT_LCD_RST_CLR();
    HAL_Delay(100);
    ROC_TFT_LCD_RST_SET();
    HAL_Delay(50);
}

/*********************************************************************************
 *  Description:
 *              Init TFT LCD register
 *
 *  Parameter:
 *              None
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
static void RocTftLcdRegInit(void)
{
    RocTftLcdReset();

    RocTftLcdWriteReg(0x11);
    RocTftLcdWriteDat(0x00);

    RocTftLcdWriteReg(0xCF);
    RocTftLcdWriteDat(0X00);
    RocTftLcdWriteDat(0XC1);
    RocTftLcdWriteDat(0X30);

    RocTftLcdWriteReg(0xED);
    RocTftLcdWriteDat(0X64);
    RocTftLcdWriteDat(0X03);
    RocTftLcdWriteDat(0X12);
    RocTftLcdWriteDat(0X81);

    RocTftLcdWriteReg(0xE8);
    RocTftLcdWriteDat(0X85);
    RocTftLcdWriteDat(0X11);
    RocTftLcdWriteDat(0X78);

    RocTftLcdWriteReg(0xF6);
    RocTftLcdWriteDat(0X01);
    RocTftLcdWriteDat(0X30);
    RocTftLcdWriteDat(0X00);

    RocTftLcdWriteReg(0xCB);
    RocTftLcdWriteDat(0X39);
    RocTftLcdWriteDat(0X2C);
    RocTftLcdWriteDat(0X00);
    RocTftLcdWriteDat(0X34);
    RocTftLcdWriteDat(0X05);

    RocTftLcdWriteReg(0xF7);
    RocTftLcdWriteDat(0X20);

    RocTftLcdWriteReg(0xEA);
    RocTftLcdWriteDat(0X00);
    RocTftLcdWriteDat(0X00);

    RocTftLcdWriteReg(0xC0);
    RocTftLcdWriteDat(0X20);

    RocTftLcdWriteReg(0xC1);
    RocTftLcdWriteDat(0X11);

    RocTftLcdWriteReg(0xC5);
    RocTftLcdWriteDat(0X31);
    RocTftLcdWriteDat(0X3C);

    RocTftLcdWriteReg(0xC7);
    RocTftLcdWriteDat(0XA9);

    RocTftLcdWriteReg(0x3A);
    RocTftLcdWriteDat(0X55);

    RocTftLcdWriteReg(0x36);

#if ROC_TFT_LCD_HORIZONTAL
    RocTftLcdWriteDat(0xE8);
#else
    RocTftLcdWriteDat(0x48);
#endif

    RocTftLcdWriteReg(0xB1);
    RocTftLcdWriteDat(0X00);
    RocTftLcdWriteDat(0X18);

    RocTftLcdWriteReg(0xB4);
    RocTftLcdWriteDat(0X00);
    RocTftLcdWriteDat(0X00);

    RocTftLcdWriteReg(0xF2);
    RocTftLcdWriteDat(0X00);

    RocTftLcdWriteReg(0x26);
    RocTftLcdWriteDat(0X01);

    RocTftLcdWriteReg(0xE0);
    RocTftLcdWriteDat(0X0F);
    RocTftLcdWriteDat(0X17);
    RocTftLcdWriteDat(0X14);
    RocTftLcdWriteDat(0X09);
    RocTftLcdWriteDat(0X0C);
    RocTftLcdWriteDat(0X06);
    RocTftLcdWriteDat(0X43);
    RocTftLcdWriteDat(0X75);
    RocTftLcdWriteDat(0X36);
    RocTftLcdWriteDat(0X08);
    RocTftLcdWriteDat(0X13);
    RocTftLcdWriteDat(0X05);
    RocTftLcdWriteDat(0X10);
    RocTftLcdWriteDat(0X0B);
    RocTftLcdWriteDat(0X08);


    RocTftLcdWriteReg(0xE1);
    RocTftLcdWriteDat(0X00);
    RocTftLcdWriteDat(0X1F);
    RocTftLcdWriteDat(0X23);
    RocTftLcdWriteDat(0X03);
    RocTftLcdWriteDat(0X0E);
    RocTftLcdWriteDat(0X04);
    RocTftLcdWriteDat(0X39);
    RocTftLcdWriteDat(0X25);
    RocTftLcdWriteDat(0X4D);
    RocTftLcdWriteDat(0X06);
    RocTftLcdWriteDat(0X0D);
    RocTftLcdWriteDat(0X0B);
    RocTftLcdWriteDat(0X33);
    RocTftLcdWriteDat(0X37);
    RocTftLcdWriteDat(0X0F);

    RocTftLcdWriteReg(0x29);	
}

/*********************************************************************************
 *  Description:
 *              Set TFT LCD X and Y position
 *
 *  Parameter:
 *              Xpos: X position
 *              Ypos: Y position
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
static void RocTftLcdSetXY(uint16_t Xpos, uint16_t Ypos)
{
    RocTftLcdWriteReg(0x2A);
    RocTftLcdWrite16Dat(Xpos);
    RocTftLcdWrite16Dat(Xpos);
    RocTftLcdWriteReg(0x2B);
    RocTftLcdWrite16Dat(Ypos);
    RocTftLcdWrite16Dat(Ypos);
    RocTftLcdWriteReg(0x2c);
}

/*********************************************************************************
 *  Description:
 *              Set TFT LCD display region
 *
 *  Parameter:
 *              XStart: X start position
 *              YStart: Y start position
 *              XEnd:   X end position
 *              YEnd:   Y end position
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
static void RocTftLcdSetRegion(uint16_t XStart, uint16_t YStart, uint16_t XEnd, uint16_t YEnd)
{
    RocTftLcdWriteReg(0x2A);
    RocTftLcdWrite16Dat(XStart);
    RocTftLcdWrite16Dat(XEnd);
    RocTftLcdWriteReg(0x2B);
    RocTftLcdWrite16Dat(YStart);
    RocTftLcdWrite16Dat(YEnd);
    RocTftLcdWriteReg(0x2c);
}

/*********************************************************************************
 *  Description:
 *              Draw a point at (X, Y) position on TFT LCD display
 *
 *  Parameter:
 *              X:      X position
 *              Y:      Y position
 *              Color:  the colour of point
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
void RocTftLcdDrawPoint(uint16_t X, uint16_t Y, uint16_t Color)
{
    RocTftLcdSetXY(X, Y);

