liren197968/SweepRobot/Stm32F4/RobotProject/Robot/RocRobotDriver/RocTftLcd/RocTftLcd.c
    RocTftLcdWrite16Dat(Color);
}

/*********************************************************************************
 *  Description:
 *              Clear all TFT LCD region with background colour
 *
 *  Parameter:
 *              BakColor: the background colour of TFT LCD
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.05.05)
**********************************************************************************/
void RocTftLcdAllClear(uint16_t BakColor)
{
    uint32_t i = 0;

    RocTftLcdSetRegion(0, 0, ROC_TFT_LCD_X_MAX_PIXEL - 1, ROC_TFT_LCD_Y_MAX_PIXEL - 1);

    ROC_TFT_LCD_RS_SET();

    for(i = 0; i < ROC_TFT_LCD_BUFF_STORAGE_PIXEL; i++)
    {
        g_TftLcdBuff[i * 2] = BakColor >> 8;
        g_TftLcdBuff[i * 2 + 1] = BakColor;
    }

    for(i = 0; i < ROC_TFT_LCD_PIXEL_SIZE / ROC_TFT_LCD_BUFF_STORAGE_PIXEL; i++)
    {
        RocTftSpiDmaWriteData(g_TftLcdBuff, ROC_TFT_LCD_BUFF_SIZE);
    }
}

/*********************************************************************************
 *  Description:
 *              Clear the TFT LCD selected region with background colour
 *
 *  Parameter:
 *              BakColor: the background colour of TFT LCD
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.05.05)
**********************************************************************************/
static void RocTftLcdRegionClear(uint16_t XStart, uint16_t YStart, uint16_t XEnd, uint16_t YEnd, uint16_t BakColor)
{
    uint32_t i = 0;
    uint32_t RegionPixel = 0;

    RegionPixel = (XEnd - XStart) * (YEnd - YStart);

    RocTftLcdSetRegion(XStart, YStart, XEnd, YEnd);

    ROC_TFT_LCD_RS_SET();

    if(ROC_TFT_LCD_BUFF_STORAGE_PIXEL < RegionPixel)
    {
        for(i = 0; i < ROC_TFT_LCD_BUFF_STORAGE_PIXEL; i++)
        {
            g_TftLcdBuff[i * 2] = BakColor >> 8;
            g_TftLcdBuff[i * 2 + 1] = BakColor;
        }

        for(i = 0; i < RegionPixel / ROC_TFT_LCD_BUFF_STORAGE_PIXEL; i++)
        {
            RocTftSpiDmaWriteData(g_TftLcdBuff, ROC_TFT_LCD_BUFF_SIZE);
        }
    }
    else
    {
        for(i = 0; i < RegionPixel; i++)
        {
            g_TftLcdBuff[i * 2] = BakColor >> 8;
            g_TftLcdBuff[i * 2 + 1] = BakColor;
        }
        RocTftSpiDmaWriteData(g_TftLcdBuff, RegionPixel * ROC_TFT_LCD_ONE_PIXEL_BYTE);
    }
}

/*********************************************************************************
 *  Description:
 *              Convert GBR format reading from ILI93xx IC to LCD RGB format
 *
 *  Parameter:
 *              GbrDat: the GBR colour data
 *
 *  Return:
 *              The RGB colour data
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
static uint16_t RocTftLcdBgr2Rgb(uint16_t GbrDat)
{
    uint16_t RDat = 0;
    uint16_t GDat = 0;
    uint16_t BDat = 0;
    uint16_t RgbDat = 0;

    BDat = (GbrDat >> 0) & 0x1f;
    GDat = (GbrDat >> 5) & 0x3f;
    RDat = (GbrDat >> 11) & 0x1f;
    RgbDat = (BDat << 11) + (GDat << 5) + (RDat << 0);

    return(RgbDat);
}

/*********************************************************************************
 *  Description:
 *              Draw a circle on TFT LCD
 *
 *  Parameter:
 *              X: the X position
 *              Y: the Y position
 *              R: the radius of the circle
 *              Color: the color of the circle
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
void RocTftLcdDrawCircle(uint16_t X, uint16_t Y, uint16_t R, uint16_t Color)
{
    /* Bresenham algorithm */
    uint16_t A;
    uint16_t B;
    int32_t C;

    A = 0;
    B = R;
    C = 3 - 2 * R;

    while(A < B)
    {
        RocTftLcdDrawPoint(X + A, Y + B, Color);     // 7
        RocTftLcdDrawPoint(X - A, Y + B, Color);     // 6
        RocTftLcdDrawPoint(X + A, Y - B, Color);     // 2
        RocTftLcdDrawPoint(X - A, Y - B, Color);     // 3
        RocTftLcdDrawPoint(X + B, Y + A, Color);     // 8
        RocTftLcdDrawPoint(X - B, Y + A, Color);     // 5
        RocTftLcdDrawPoint(X + B, Y - A, Color);     // 1
        RocTftLcdDrawPoint(X - B, Y - A, Color);     // 4

        if( C < 0)
        {
            C = C + 4 * A + 6;
        }
        else
        {
            C= C + 4 * (A - B) + 10;
            B -= 1;
        }

        A += 1;
    } 

    if(A == B)
    {
        RocTftLcdDrawPoint(X + A, Y + B, Color);
        RocTftLcdDrawPoint(X + A, Y + B, Color);
        RocTftLcdDrawPoint(X + A, Y - B, Color);
        RocTftLcdDrawPoint(X - A, Y - B, Color);
        RocTftLcdDrawPoint(X + B, Y + A, Color);
        RocTftLcdDrawPoint(X - B, Y + A, Color);
        RocTftLcdDrawPoint(X + B, Y - A, Color);
        RocTftLcdDrawPoint(X - B, Y - A, Color);
    }
} 

/*********************************************************************************
 *  Description:
 *              Draw a line on TFT LCD
 *
 *  Parameter:
 *              XStart: X start position
 *              YStart: Y start position
 *              XEnd:   X end position
 *              YEnd:   Y end position
 *              Color:  the color of the line
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
void RocTftLcdDrawLine(uint16_t XStart, uint16_t YStart,uint16_t XEnd, uint16_t YEnd,uint16_t Color)
{
    /* Bresenham algorithm */
    int32_t Dx;             // difference in x's
    int32_t Dy;             // difference in y's
    int32_t Dx2;            // Dx, Dy * 2
    int32_t Dy2;
    int32_t XInc;           // amount in pixel space to move during drawing
    int32_t YInc;           // amount in pixel space to move during drawing
    int32_t Error;          // the discriminant i.e. error i.e. decision variable
    int32_t Index;          // used for looping	

    RocTftLcdSetXY(XStart,YStart);

    Dx = XEnd - XStart;
    Dy = YEnd - YStart;

