liren197968/SweepRobot/Stm32F4/RobotProject/Robot/RocRobotDriver/RocTftLcd/RocTftLcd.c
    if(Dx >= 0)
    {
        XInc = 1;
    }
    else
    {
        XInc = -1;
        Dx = -Dx;
    }

    if (Dy>=0)
    {
        YInc = 1;
    }
    else
    {
        YInc = -1;
        Dy = -Dy;
    } 

    Dx2 = Dx << 1;
    Dy2 = Dy << 1;

    if(Dx > Dy)
    {
        // initialize error term
        Error = Dy2 - Dx;

        // draw the line
        for(Index = 0; Index <= Dx; Index++)
        {
            RocTftLcdDrawPoint(XStart,YStart,Color);

            // test if error has overflowed
            if(Error >= 0)
            {
                Error -= Dx2;

                // move to next line
                YStart += YInc;
            }

            // adjust the error term
            Error += Dy2;

            // move to the next pixel
            XStart += XInc;
        }
    }
    else
    {
        // initialize error term
        Error = Dx2 - Dy;

        // draw the line
        for(Index = 0; Index <= Dy; Index++)
        {
            // set the pixel
            RocTftLcdDrawPoint(XStart,YStart,Color);

            // test if error overflowed
            if(Error >= 0)
            {
                Error-=Dy2;

                // move to next line
                XStart += XInc;
            }

            // adjust the error term
            Error += Dx2;

            // move to the next pixel
            YStart += YInc;
        }
    }
}

/*********************************************************************************
 *  Description:
 *              Draw a rectangle on TFT LCD
 *
 *  Parameter:
 *              X:      X position
 *              Y:      Y position
 *              W:      the rectangle width
 *              H:      the rectangle height
 *              Color:  the color of the rectangle
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
void RocTftLcdDrawRectangle(uint16_t X, uint16_t Y, uint16_t W, uint16_t H, uint16_t Color)
{
    RocTftLcdDrawLine(X, Y, X + W, Y, 0xEF7D);
    RocTftLcdDrawLine(X + W-1, Y + 1, X + W - 1,Y + 1 + H, 0x2965);
    RocTftLcdDrawLine(X, Y + H, X + W, Y + H, 0x2965);
    RocTftLcdDrawLine(X, Y,X, Y + H, 0xEF7D);
    RocTftLcdDrawLine(X + 1, Y + 1, X + 1 + W - 2, Y + 1 + H - 2, Color);
}

/*********************************************************************************
 *  Description:
 *              Draw a rectangle on TFT LCD
 *
 *  Parameter:
 *              X:      X position
 *              Y:      Y position
 *              W:      the rectangle width
 *              H:      the rectangle height
 *              Color:  the color of the rectangle
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
void RocTftLcdDrawRectangle2(uint16_t X, uint16_t Y, uint16_t W, uint16_t H, uint8_t Mode)
{
    if(Mode == 0)
    {
        RocTftLcdDrawLine(X, Y, X + W, Y, 0xEF7D);
        RocTftLcdDrawLine(X + W - 1, Y + 1, X + W - 1, Y + 1 + H, 0x2965);
        RocTftLcdDrawLine(X, Y + H, X + W, Y + H, 0x2965);
        RocTftLcdDrawLine(X, Y, X, Y + H, 0xEF7D);
    }
    if(Mode == 1)
    {
        RocTftLcdDrawLine(X, Y, X + W, Y, 0x2965);
        RocTftLcdDrawLine(X + W - 1, Y + 1, X + W - 1, Y + 1 + H, 0xEF7D);
        RocTftLcdDrawLine(X, Y + H, X + W, Y + H, 0xEF7D);
        RocTftLcdDrawLine(X, Y, X, Y + H, 0x2965);
    }
    if(Mode == 2)
    {
        RocTftLcdDrawLine(X, Y, X + W, Y, 0xFFFF);
        RocTftLcdDrawLine(X + W - 1, Y + 1, X + W - 1, Y + 1 + H, 0xFFFF);
        RocTftLcdDrawLine(X, Y + H, X + W, Y + H, 0xFFFF);
        RocTftLcdDrawLine(X, Y, X, Y + H, 0xFFFF);
    }
}

/*********************************************************************************
 *  Description:
 *              Draw a button on TFT LCD
 *
 *  Parameter:
 *              XStart: X start position
 *              YStart: Y start position
 *              XEnd:   X end position
 *              YEnd:   Y end position
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
static void RocTftLcdDisplayButtonDown(uint16_t XStart, uint16_t YStart, uint16_t XEnd, uint16_t YEnd)
{
    RocTftLcdDrawLine(XStart, YStart, XEnd, YStart, ROC_TFT_LCD_COLOR_GRAY_2);              //H
    RocTftLcdDrawLine(XStart + 1,YStart + 1, XEnd, YStart + 1, ROC_TFT_LCD_COLOR_GRAY_1);   //H
    RocTftLcdDrawLine(XStart, YStart, XStart, YEnd, ROC_TFT_LCD_COLOR_GRAY_2);              //V
    RocTftLcdDrawLine(XStart + 1,YStart + 1, XStart + 1, YEnd, ROC_TFT_LCD_COLOR_GRAY_1);   //V
    RocTftLcdDrawLine(XStart, YEnd, XEnd, YEnd, ROC_TFT_LCD_COLOR_WHITE);                   //H
    RocTftLcdDrawLine(XEnd,  YStart, XEnd, YEnd, ROC_TFT_LCD_COLOR_WHITE);                  //V
}

/*********************************************************************************
 *  Description:
 *              Draw a button on TFT LCD
 *
 *  Parameter:
 *              XStart: X start position
 *              YStart: Y start position
 *              XEnd:   X end position
 *              YEnd:   Y end position
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
static void RocTftLcdDisplayButtonUp(uint16_t XStart,uint16_t YStart,uint16_t XEnd,uint16_t YEnd)
{
    RocTftLcdDrawLine(XStart, YStart, XEnd, YStart, ROC_TFT_LCD_COLOR_WHITE);           //H
    RocTftLcdDrawLine(XStart, YStart, XStart, YEnd, ROC_TFT_LCD_COLOR_WHITE);           //V

    RocTftLcdDrawLine(XStart + 1, YEnd - 1, XEnd,YEnd - 1, ROC_TFT_LCD_COLOR_GRAY_1);   //H
    RocTftLcdDrawLine(XStart, YEnd, XEnd, YEnd, ROC_TFT_LCD_COLOR_GRAY_2);              //H
    RocTftLcdDrawLine(XEnd - 1, YStart + 1, XEnd - 1, YEnd, ROC_TFT_LCD_COLOR_GRAY_1);  //V
    RocTftLcdDrawLine(XEnd, YStart, XEnd, YEnd, ROC_TFT_LCD_COLOR_GRAY_2);              //V
}

/*********************************************************************************
 *  Description:
 *              Show a string on TFT LCD
 *
 *  Parameter:
 *              X:    X position
 *              Y:    Y position
 *              Fc:   font colour
 *              Bc:   background colour
 *              pStr: the pointer to string
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
void RocTftLcdDrawGbk16Str(uint16_t X, uint16_t Y, uint16_t Fc, uint16_t Bc, uint8_t *pStr)
{
    uint16_t i = 0;
    uint16_t j = 0;
    uint16_t k = 0;
    uint16_t x0 = 0;
    uint16_t l = 0;
    uint16_t Size = 0;

    x0 = X;

