liren197968/SweepRobot/Stm32F4/RobotProject/Robot/RocRobotDriver/RocTftLcd/RocTftLcd.c
    while(*pStr)
    {
        Size++;
        pStr++;
    }

    pStr = pStr - Size;

    while(*pStr)
    {
        if((*pStr) < 128)
        {
            k = *pStr;

            if(k == 13)
            {
                X = x0;
                Y += 16;
            }
            else
            {
                if(k > 32)
                {
                    k -= 32;
                }
                else
                {
                    k=0;
                }

                for(i = 0; i < 16; i++)
                {
                    for(j = 0; j < 8; j++)
                    {
                        if(g_Ascii16[k * 16 + i] & (0x80 >> j))
                        {
                            //RocTftLcdDrawPoint(X + j, Y + i, Fc);

                            g_TftLcdStrBuff[2 * (i * Size * ROC_TFT_LCD_WIDTH_GBK_16 + j + l)] = Fc >> 8;
                            g_TftLcdStrBuff[2 * (i * Size * ROC_TFT_LCD_WIDTH_GBK_16 + j + l) + 1] = Fc;
                        }
                        else
                        {
                            if(Fc != Bc)
                            {
                                //RocTftLcdDrawPoint(X + j, Y + i, Bc);

                                g_TftLcdStrBuff[2 * (i * Size * ROC_TFT_LCD_WIDTH_GBK_16 + j + l)] = Bc >> 8;
                                g_TftLcdStrBuff[2 * (i * Size * ROC_TFT_LCD_WIDTH_GBK_16 + j + l) + 1] = Bc;
                            }
                        }
                    }
                }

                l += ROC_TFT_LCD_WIDTH_GBK_16;
            }

            pStr++;
        }
        else
        {
            for(k = 0; k < ROC_TFT_LCD_HZ16_NUM; k++)
            {
                if((g_Hz16[k].Index[0] == *(pStr)) && (g_Hz16[k].Index[1] == *(pStr + 1)))
                {
                    for(i = 0; i < 16; i++)
                    {
                        for(j = 0; j < 8; j++)
                        {
                            if(g_Hz16[k].Msk[i * 2] & (0x80 >> j))
                            {
                                RocTftLcdDrawPoint(X + j, Y + i, Fc);
                            }
                            else
                            {
                                if(Fc != Bc)
                                {
                                    RocTftLcdDrawPoint(X + j, Y + i, Bc);
                                }
                            }
                        }

                        for(j = 0; j < 8; j++)
                        {
                            if(g_Hz16[k].Msk[i * 2 + 1] & (0x80 >> j))
                            {
                                RocTftLcdDrawPoint(X + j + 8, Y + i, Fc);
                            }
                            else
                            {
                                if(Fc != Bc)
                                {
                                    RocTftLcdDrawPoint(X + j + 8, Y + i, Bc);
                                }
                            }
                        }
                    }
                }

                pStr += 2;
                X += 16;
            }
        }
    }

    RocTftLcdSetRegion(X, Y, X + Size * ROC_TFT_LCD_WIDTH_GBK_16 - 1, Y + ROC_TFT_LCD_HEIGHT_GBK_16 - 1);

    ROC_TFT_LCD_RS_SET();

    RocTftSpiDmaWriteData(g_TftLcdStrBuff, Size * ROC_TFT_LCD_WIDTH_GBK_16 * ROC_TFT_LCD_HEIGHT_GBK_16 * ROC_TFT_LCD_ONE_PIXEL_BYTE);
}

/*********************************************************************************
 *  Description:
 *              Show a string on TFT LCD
 *
 *  Parameter:
 *              X:    X position
 *              Y:    Y position
 *              Fc:   font colour
 *              Bc:   background colour
 *              pStr: the pointer to string
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
void RocTftLcdDrawGbk24Str(uint16_t X, uint16_t Y, uint16_t Fc, uint16_t Bc, uint8_t *pStr)
{
    uint16_t i = 0;
    uint16_t j = 0;
    uint16_t k = 0;
    uint16_t l = 0;
    uint16_t Size = 0;

    while(*pStr)
    {
        Size++;
        pStr++;
    }

    pStr = pStr - Size;

    while(*pStr)
    {
        if(*pStr < 0x80)
        {
            k = *pStr;

            if (k > 32)
            {
                k -= 32;
            }
            else
            {
                k = 0;
            }

            for(i = 0; i < 16; i++)
            {
                for(j = 0; j < 8; j++)
                {
                    if(g_Ascii16[k * 16 + i] & (0x80 >> j))
                    {
                        //RocTftLcdDrawPoint(X + j, Y + i, Fc);

                        g_TftLcdStrBuff[2 * (i * Size * ROC_TFT_LCD_WIDTH_GBK_16 + j + l)] = Fc >> 8;
                        g_TftLcdStrBuff[2 * (i * Size * ROC_TFT_LCD_WIDTH_GBK_16 + j + l) + 1] = Fc;
                    }
                    else
                    {
                        if(Fc != Bc)
                        {
                            //RocTftLcdDrawPoint(X + j, Y + i, Bc);

                            g_TftLcdStrBuff[2 * (i * Size * ROC_TFT_LCD_WIDTH_GBK_16 + j + l)] = Bc >> 8;
                            g_TftLcdStrBuff[2 * (i * Size * ROC_TFT_LCD_WIDTH_GBK_16 + j + l) + 1] = Bc;
                        }
                    }
                }
            }

            pStr++;
            l += ROC_TFT_LCD_WIDTH_GBK_16;
        }
        else
        {
            for(k = 0; k < ROC_TFT_LCD_HZ24_NUM; k++)
            {
                if((g_Hz24[k].Index[0] == *(pStr)) && (g_Hz24[k].Index[1] == *(pStr + 1)))
                {
                    for(i = 0; i < 24; i++)
                    {
                        for(j = 0; j < 8; j++)
                        {
                            if(g_Hz24[k].Msk[i*3] & (0x80 >> j))
                            {
                                RocTftLcdDrawPoint(X + j, Y + i, Fc);
                            }
                            else
                            {
                                if(Fc != Bc)
                                {
                                    RocTftLcdDrawPoint(X + j, Y + i, Bc);
                                }
                            }
                        }

                        for(j = 0; j < 8; j++)
                        {
                            if(g_Hz24[k].Msk[i * 3 + 1] & (0x80 >> j))
                            {
                                RocTftLcdDrawPoint(X + j + 8, Y + i, Fc);
                            }
                            else
                            {
                                if(Fc != Bc)
                                {
                                    RocTftLcdDrawPoint(X + j + 8, Y + i, Bc);
                                }
                            }
                        }

                        for(j = 0; j < 8; j++)
                        {
                            if(g_Hz24[k].Msk[i * 3 + 2] & (0x80 >> j))
                            {
                                RocTftLcdDrawPoint(X + j + 16, Y + i, Fc);
                            }
                            else
                            {
                                if(Fc != Bc)
                                {
                                    RocTftLcdDrawPoint(X + j + 16, Y + i, Bc);
                                }
                            }
                        }
                    }
                }
            }

            pStr += 2;
            X += 24;
        }
    }

