liren197968/SweepRobot/Stm32F4/RobotProject/Robot/RocRobotDriver/RocTftLcd/RocTftLcd.c
    RocTftLcdSetRegion(X, Y, X + Size * ROC_TFT_LCD_WIDTH_GBK_16 - 1, Y + ROC_TFT_LCD_HEIGHT_GBK_16 - 1);

    ROC_TFT_LCD_RS_SET();

    RocTftSpiDmaWriteData(g_TftLcdStrBuff, Size * ROC_TFT_LCD_WIDTH_GBK_16 * ROC_TFT_LCD_HEIGHT_GBK_16 * ROC_TFT_LCD_ONE_PIXEL_BYTE);
}

/*********************************************************************************
 *  Description:
 *              Show a error massage on TFT LCD
 *
 *  Parameter:
 *              pStr: the pointer to errot massage string
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
void RocTftLcdShowErrorMsg(uint8_t *pStr)
{
    RocTftLcdDrawGbk24Str(100, 215, ROC_TFT_LCD_COLOR_RED, ROC_TFT_LCD_COLOR_YELLOW, pStr);
}

/*********************************************************************************
 *  Description:
 *              Show a double number on TFT LCD
 *
 *  Parameter:
 *              X:    X position
 *              Y:    Y position
 *              Fc:   font colour
 *              Bc:   background colour
 *              Num:  the display double number
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
void RocTftLcdDrawGbk16Num(uint16_t X, uint16_t Y, uint16_t Fc, uint16_t Bc, float Num)
{
    uint16_t    i = 0;
    ROC_RESULT  Ret = RET_OK;
    uint8_t     NumStr[ROC_TFT_LCD_SUPPORT_NUM_LEN + 1];

    if(ROC_TFT_LCD_SUPPORT_MAX_NUM < Num
    || ROC_TFT_LCD_SUPPORT_MIN_NUM > Num)
    {
        ROC_LOGE("Input data is out of the TFT LCD show range(%lf)", Num);
        RocTftLcdShowErrorMsg("DATA ERROR!");
    }
    else
    {
        Ret = RocDoubleDatToStringDat(Num, NumStr);
        if(RET_OK == Ret)
        {
            RocTftLcdWaitWriteDone();   /* To wait the string buffer write done */

            for(i = 0; i < ROC_TFT_LCD_STR_PIXEL_SIZE; i++)
            {
                g_TftLcdStrBuff[i * 2] = ROC_TFT_LCD_COLOR_DEFAULT_BAK >> 8;
                g_TftLcdStrBuff[i * 2 + 1] = ROC_TFT_LCD_COLOR_DEFAULT_BAK;
            }

            RocTftLcdDrawGbk16Str(X, Y, Fc, Bc, NumStr);
        }
        else
        {
            ROC_LOGE("Double to string convertion is in error!");
            RocTftLcdShowErrorMsg("CONVERT ERROR!");
        }
    }
}

/*********************************************************************************
 *  Description:
 *              Show a double number on TFT LCD
 *
 *  Parameter:
 *              X:    X position
 *              Y:    Y position
 *              Fc:   font colour
 *              Bc:   background colour
 *              Num:  the display double number
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)

**********************************************************************************/
void RocTftLcdDrawGbk24Num(uint16_t X, uint16_t Y, uint16_t Fc, uint16_t Bc, float Num)
{
    uint16_t    i = 0;
    ROC_RESULT  Ret = RET_OK;
    uint8_t     NumStr[ROC_TFT_LCD_SUPPORT_NUM_LEN + 1] = {0};

    if(ROC_TFT_LCD_SUPPORT_MAX_NUM < Num
    || ROC_TFT_LCD_SUPPORT_MIN_NUM > Num)
    {
        ROC_LOGE("Input data is out of the TFT LCD show range(%lf)", Num);
        RocTftLcdShowErrorMsg("DATA ERROR!");
    }
    else
    {
        Ret = RocDoubleDatToStringDat(Num, NumStr);

        if(RET_OK == Ret)
        {
            RocTftLcdWaitWriteDone();   /* To wait the string buffer write done */

            for(i = 0; i < ROC_TFT_LCD_STR_PIXEL_SIZE; i++)
            {
                g_TftLcdStrBuff[i * 2] = ROC_TFT_LCD_COLOR_DEFAULT_BAK >> 8;
                g_TftLcdStrBuff[i * 2 + 1] = ROC_TFT_LCD_COLOR_DEFAULT_BAK;
            }

            RocTftLcdDrawGbk24Str(X, Y, Fc, Bc, NumStr);
        }
        else
        {
            ROC_LOGE("Double to string convertion is in error!");
            RocTftLcdShowErrorMsg("CONVERT ERROR!");
        }
    }
}

/*********************************************************************************
 *  Description:
 *              Draw a button on TFT LCD
 *
 *  Parameter:
 *              X:   X position
 *              Y:   Y position
 *              Fc:  font colour
 *              Bc:  background colour
 *              Num: the num to display
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
void RocTftLcdDrawTubeNum(uint16_t X, uint16_t Y, uint16_t Fc, uint16_t Bc, uint16_t Num)
{
    uint16_t i = 0;
    uint16_t j = 0;
    uint16_t k = 0;
    uint16_t c = 0;

    for(i = 0; i < 32; i++)
    {
        for(j = 0; j < 4; j++)
        {
            c = *(g_Sz32 + Num * 32 * 4 + i * 4 + j);

            for(k = 0; k < 8; k++)
            {
                if(c & (0x80 >> k))
                {
                    RocTftLcdDrawPoint(X + j * 8 + k, Y+i, Fc);
                }
                else
                {
                    if(Fc != Bc)
                    {
                        RocTftLcdDrawPoint(X + j * 8 + k, Y + i, Bc);
                    }
                }
            }
        }
    }
}

/*********************************************************************************
 *  Description:
 *              Draw a menu test on TFT LCD
 *
 *  Parameter:
 *              None
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
static void RocTftLcdMainMenuTest(void)
{
    RocTftLcdRegionClear(10, 10, 20, 20, ROC_TFT_LCD_COLOR_DEFAULT_BAK);
    RocTftLcdAllClear(ROC_TFT_LCD_COLOR_GRAY_0);

    RocTftLcdDrawGbk16Str(16,2,ROC_TFT_LCD_COLOR_BLUE,ROC_TFT_LCD_COLOR_GRAY_0,"全动电子技术");
    RocTftLcdDrawGbk16Str(16,20,ROC_TFT_LCD_COLOR_RED,ROC_TFT_LCD_COLOR_GRAY_0,"液晶测试程序");

    RocTftLcdBgr2Rgb(0);
    RocTftLcdDisplayButtonDown(0,0,0,0);
    RocTftLcdDrawGbk24Str(0,0,0,0,0);

    RocTftLcdDisplayButtonUp(15,38,113,58); //XStart,YStart,XEnd,YEnd
    RocTftLcdDrawGbk16Str(16,40,ROC_TFT_LCD_COLOR_GREEN,ROC_TFT_LCD_COLOR_GRAY_0,"颜色填充测试");

    RocTftLcdDisplayButtonUp(15,68,113,88); //XStart,YStart,XEnd,YEnd
    RocTftLcdDrawGbk16Str(16,70,ROC_TFT_LCD_COLOR_BLUE,ROC_TFT_LCD_COLOR_GRAY_0,"文字显示测试");

