liren197968/SweepRobot/Stm32F4/RobotProject/Robot/RocRobotDriver/RocTftLcd/RocTftLcd.c
    RocTftLcdDisplayButtonUp(15,98,113,118); //XStart,YStart,XEnd,YEnd
    RocTftLcdDrawGbk16Str(16,100,ROC_TFT_LCD_COLOR_RED,ROC_TFT_LCD_COLOR_GRAY_0,"图片显示测试");

    //RocTftLcdDrawGbk16Str(16,120,ROC_TFT_LCD_COLOR_BLUE,ROC_TFT_LCD_COLOR_GRAY_0,"Welcome");
    RocTftLcdDrawGbk16Str(16,140,ROC_TFT_LCD_COLOR_RED,ROC_TFT_LCD_COLOR_GRAY_0, "Welcome");

    RocTftLcdDrawTubeNum(100,125,ROC_TFT_LCD_COLOR_RED,ROC_TFT_LCD_COLOR_GRAY_0,g_DisplayNum[5]);
    HAL_Delay(1000);
    RocTftLcdDrawTubeNum(100,125,ROC_TFT_LCD_COLOR_RED,ROC_TFT_LCD_COLOR_GRAY_0,g_DisplayNum[4]);
    HAL_Delay(1000);
    RocTftLcdDrawTubeNum(100,125,ROC_TFT_LCD_COLOR_RED,ROC_TFT_LCD_COLOR_GRAY_0,g_DisplayNum[3]);
    HAL_Delay(1000);
    RocTftLcdDrawTubeNum(100,125,ROC_TFT_LCD_COLOR_RED,ROC_TFT_LCD_COLOR_GRAY_0,g_DisplayNum[2]);
    HAL_Delay(1000);
    RocTftLcdDrawTubeNum(100,125,ROC_TFT_LCD_COLOR_RED,ROC_TFT_LCD_COLOR_GRAY_0,g_DisplayNum[1]);
    HAL_Delay(1000);
    RocTftLcdDrawTubeNum(100,125,ROC_TFT_LCD_COLOR_RED,ROC_TFT_LCD_COLOR_GRAY_0,g_DisplayNum[0]);	
}

/*********************************************************************************
 *  Description:
 *              Draw a rectangle on TFT LCD
 *
 *  Parameter:
 *              None
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
static void RocTftLcdNumTest(void)
{
    uint8_t i=0;

    RocTftLcdAllClear(ROC_TFT_LCD_COLOR_GRAY_0);
    RocTftLcdDrawGbk16Str(16,20,ROC_TFT_LCD_COLOR_RED,ROC_TFT_LCD_COLOR_GRAY_0,"Num Test");
    HAL_Delay(1000);
    RocTftLcdAllClear(ROC_TFT_LCD_COLOR_GRAY_0);

    for(i = 0; i < 10; i++)
    {
        RocTftLcdDrawTubeNum((i % 3) * 40, 32 * (i / 3) + 30, ROC_TFT_LCD_COLOR_RED, ROC_TFT_LCD_COLOR_GRAY_0, g_DisplayNum[i + 1]);
        HAL_Delay(100);
    }
}
/*********************************************************************************
 *  Description:
 *              Chinese and english font display test on TFT LCD
 *
 *  Parameter:
 *              None
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
static void RocTftLcdFontTest(void)
{
    RocTftLcdAllClear(ROC_TFT_LCD_COLOR_GRAY_0);
    RocTftLcdDrawGbk16Str(16,10,ROC_TFT_LCD_COLOR_BLUE,ROC_TFT_LCD_COLOR_GRAY_0,"文字显示测试");

    HAL_Delay(1000);
    RocTftLcdAllClear(ROC_TFT_LCD_COLOR_GRAY_0);
    RocTftLcdDrawGbk16Str(16,30,ROC_TFT_LCD_COLOR_RED,ROC_TFT_LCD_COLOR_GRAY_0,"全动电子技术");
    RocTftLcdDrawGbk16Str(16,50,ROC_TFT_LCD_COLOR_BLUE,ROC_TFT_LCD_COLOR_GRAY_0,"专注液晶批发");
    RocTftLcdDrawGbk16Str(16,70,ROC_TFT_LCD_COLOR_RED,ROC_TFT_LCD_COLOR_GRAY_0, "全程技术支持");
    RocTftLcdDrawGbk16Str(0,100,ROC_TFT_LCD_COLOR_BLUE,ROC_TFT_LCD_COLOR_GRAY_0,"Tel:15989313508");
    RocTftLcdDrawGbk16Str(0,130,ROC_TFT_LCD_COLOR_RED,ROC_TFT_LCD_COLOR_GRAY_0, "www.qdtech.net");	
    HAL_Delay(1500);
}

/*********************************************************************************
 *  Description:
 *              TFT LCD colour test
 *
 *  Parameter:
 *              None
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
static void RocTftLcdColorTest(void)
{
    uint8_t i=1;

    RocTftLcdAllClear(ROC_TFT_LCD_COLOR_GRAY_0);

    RocTftLcdDrawGbk16Str(20,10,ROC_TFT_LCD_COLOR_BLUE,ROC_TFT_LCD_COLOR_GRAY_0,"颜色填充测试");
    HAL_Delay(1200);

    while(i--)
    {
        RocTftLcdAllClear(ROC_TFT_LCD_COLOR_WHITE); HAL_Delay(500);
        RocTftLcdAllClear(ROC_TFT_LCD_COLOR_BLACK); HAL_Delay(500);
        RocTftLcdAllClear(ROC_TFT_LCD_COLOR_RED);   HAL_Delay(500);
        RocTftLcdAllClear(ROC_TFT_LCD_COLOR_GREEN); HAL_Delay(500);
        RocTftLcdAllClear(ROC_TFT_LCD_COLOR_BLUE);  HAL_Delay(500);
    }
}

/*********************************************************************************
 *  Description:
 *              Show a picture on TFT LCD
 *
 *  Parameter:
 *              pStr: the pointer to string
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
static void RocTftLcdShowImage(const unsigned char *pStr)
{
    int32_t i,j,k;
    uint16_t picH,picL;

    RocTftLcdAllClear(ROC_TFT_LCD_COLOR_GRAY_0);
    RocTftLcdDrawGbk16Str(16,10,ROC_TFT_LCD_COLOR_BLUE,ROC_TFT_LCD_COLOR_GRAY_0, "图片显示测试");
    HAL_Delay(1000);

    RocTftLcdAllClear(ROC_TFT_LCD_COLOR_GRAY_0);

    for(k = 0; k < ROC_TFT_LCD_Y_MAX_PIXEL / 40; k++)
    {
        for(j = 0; j < ROC_TFT_LCD_X_MAX_PIXEL / 40; j++)
        {
            RocTftLcdSetRegion(40 * j, 40 * k, 40 * j + 39, 40 * k + 39);

            for(i = 0; i < 40 * 40; i++)
            {
                picL = *(pStr + i * 2);
                picH = *(pStr + i * 2 + 1);

                RocTftLcdWrite16Dat(picH << 8 | picL);
            }
        }
    }
}

/*********************************************************************************
 *  Description:
 *              TFT demo test
 *
 *  Parameter:
 *              None
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
static void RocTftLcdTestDemo(void)
{
    RocTftLcdRegInit();
    RocTftLcdMainMenuTest();
    RocTftLcdColorTest();
    RocTftLcdNumTest();
    RocTftLcdFontTest();
    RocTftLcdShowImage(g_ImageQQ);
    HAL_Delay(1500);
}

/*********************************************************************************
 *  Description:
 *              TFT LCD init
 *
 *  Parameter:
 *              None
 *
 *  Return:
 *              None
 *
 *  Author:
 *              ROC LiRen(2019.04.21)
**********************************************************************************/
ROC_RESULT RocTftLcdInit(void)
{
    ROC_RESULT Ret = RET_OK;

    RocTftLcdRegInit();

    RocTftLcdAllClear(ROC_TFT_LCD_COLOR_DEFAULT_BAK);

    if(RET_OK != Ret)
    {
        RocTftLcdTestDemo();
    }

    if(RET_OK != Ret)
    {
        ROC_LOGE("TFT LCD init is in error!");
    }
    else
    {
        ROC_LOGI("TFT LCD init is in success");
    }

    return Ret;
}


